declare 1 value_descriptor based,
          2 data_type binary(15),
          2 value binary(31);
declare 1 augmented_value_descriptor based,
          2 data_type binary(15),
          2 value binary(31),
          2 rel_value binary(31);
declare 1 field_value_descriptor based,
          2 data_type binary(15),
          2 value binary(31),
          2 field_info pointer;
declare 1 value_list_descriptor based,
          2 value binary(31),
          2 next pointer;
