/*
 *   class_test.pl1
 *
 *   Test object behavior module for MicroCosm(TM).
 *
 *   Chip Morningstar
 *   Lucasfilm Ltd.
 *   9-August-1986
 */

%include 'microcosm.incl.pl1';
%include 'defs_helper.incl.pl1';
%include 'defs_action.incl.pl1';

initialize_class_test: procedure;

     %replace TEST_REQUESTS by 3;

     declare a(0:TEST_REQUESTS) entry based;
     declare class_test_actions pointer;
     declare 1 test based %include struct_test;

     %replace I by CLASS_TEST;

     Class_Table(I).capacity = 0;
     Class_Table(I).max_requests = TEST_REQUESTS;
     Class_Table(I).alloc_size = size(test);
     Class_Table(I).pc_state_bytes = 0;
     Class_Table(I).known = true;
     Class_Table(I).opaque_container = false;
     Class_Table(I).filler = false;

     allocate a set(class_test_actions);
     Class_Table(I).actions = class_test_actions;

     Class_Table(I).actions->a(HELP) = generic_HELP; /* 0 */
     Class_Table(I).actions->a(1)   = generic_TEST;   /* 1 */
     Class_Table(I).actions->a(2)   = generic_TEST;   /* 2 */
     Class_Table(I).actions->a(3)   = generic_TEST;   /* 3 */

end initialize_class_test;

generic_TEST: procedure;
     declare i binary(15);

     i = 47;
     call r_msg_1(TRUE);
end generic_TEST;
