declare 1 command_descriptor based,
          2 command_function binary(15),
          2 arg1 binary(31),
          2 arg2 binary(31);
declare 1 command_list_descriptor based,
          2 command binary(31),
          2 next pointer,
          2 filenamenum binary(31),
          2 append_flag bit(1);
